import * as yup from 'yup';

yup.setLocale({
	mixed: {
		default: 'Недопустимое значение',
		required: 'Это поле обязательно для заполнения',
		oneOf: 'Пароли не совпадают',
		notOneOf: 'Значение не должно быть одним из следующих: ${values}',
	},
	string: {
		length: 'Длина должна быть ровно ${length} символов',
		min: 'Минимум ${min} символов',
		max: 'Максимум ${max} символов',
		matches: 'Значение должно соответствовать следующему шаблону: "${regex}"',
		email: 'Некорректный формат электронной почты',
		url: 'Некорректный URL-адрес',
		trim: 'Значение не должно содержать пробелов в начале и в конце',
		lowercase: 'Значение должно быть в нижнем регистре',
		uppercase: 'Значение должно быть в верхнем регистре',
	},
	number: {
		min: 'Значение должно быть больше или равно ${min}',
		max: 'Значение должно быть меньше или равно ${max}',
		lessThan: 'Значение должно быть меньше ${less}',
		moreThan: 'Значение должно быть больше ${more}',
		positive: 'Значение должно быть положительным числом',
		negative: 'Значение должно быть отрицательным числом',
		integer: 'Значение должно быть целым числом',
		// typeError: 'Значение должно быть числом',
	},
	date: {
		min: 'Дата должна быть позже ${min}',
		max: 'Дата должна быть раньше ${max}',
	},
	array: {
		min: 'Должно быть минимум ${min} элементов',
		max: 'Должно быть максимум ${max} элементов',
	},
});

export { yup };
